[
    {
    "title": "Brush After Meals",
    "text": "One of the best things you can do for both the appearance of your smile and the health of it is to brush your teeth twice a day. However, brushing your teeth after meals, in addition to brushing in the morning and at night, can go even further in preventing staining and decay. After all, the sooner you’re able to remove anything that can cause staining, the less of a chance it has to discolor your teeth.",
    "user_id": 2

  },
  {
    "title": "Swish, Rinse",
    "text": "For those times when you can’t brush your teeth after eating, the next best thing you can do is swish and rinse your mouth out with water. Water will help wash away any lingering staining agents before they have a chance to settle in and cause discoloration. If you want to take it one step further, chew sugarless gum to remove even more food particles.",
    "user_id": 6
  },
   {
    "title": "Choose a Straw",
    "text": "A simple way to reduce the risk of tooth discoloration when drinking tooth-staining beverages is to sip them through a straw. Straws essentially allow the liquid to bypass teeth and lowers the likelihood of staining. There are several reusable straws you can buy and carry with you in case you run into a situation where straws aren’t available. ",

    "user_id": 1
  },
   {
    "title": "WHAT YOUR DENTIST CAN TELL JUST FROM LOOKING AT YOUR TEETH",
    "text": "Your dentist in Rockville Centre will often ask you things about your overall health as well as your habits, and with good reason. But there are times when patients aren’t comfortable sharing some aspects of their life with their dental team and instead try to keep these things a secret. However, we have a secret of our own — we most likely already know your secrets. \n\nThere are some things your dentist can tell you about you just from looking at your teeth, even if you don’t volunteer that information with them. Let’s take a look at some of the things your dentist in Rockville Centre may notice about you and your habits. ",
    "user_id": 1
  },
   {
    "title": "You’re a Nail Biter",
    "text": "Why would your dentist care if you nervously or habitually bite your nails? Well, nail biters often have tiny chips or cracks in their teeth that may be invisible to the naked eye but can show up on dental x-rays. These cracks provide a great place for bacteria to nestle in and increase the likelihood of decay. Nail biters may also suffer from TMD or TMJ thanks to changes in their bite. TMD/TMJ disorder can be a painful condition that may also lead to headaches and increased jaw pain or jaw clicking. \n\nYou’re a Smoker\nOne of the most common habits patients try to hide is being a smoker. They’ll use perfume, mints, mouthwash, and everything in between to try and cover up the smell of cigarettes. But the truth is, your dentist in Rockville Centre can probably still tell that you smoke. You see, cigarette smoke doesn’t just disappear. In fact, the smell can seep into the soft tissues of your mouth and linger around long after you light up. Additionally, smokers tend to have telltale tooth staining as a result of the nicotine.  ",
    "user_id": 2
  },
   {
    "title": "You Don’t Brush Often Enough",
    "text": "Similarly to flossing, your dental team will also be able to tell if you don’t brush your teeth often enough or even if you brush too hard. Those who don’t brush the recommended two times a day will often have larger areas of tartar buildup and puffy, red gums. Additionally, if you brush too hard you may have gum recession or worn enamel which can cause tooth sensitivity and increase your chances of cavities. \n\nWe encourage you to always be honest with your dentist in Rockville Centre and every member of your healthcare team. If we don’t know about certain things that can affect both your health and your treatment, you won’t get the best care possible for you. We understand that some things may be embarrassing to share, but it’s important to know that your dental team is only here to help you, not to judge you. ",
    "user_id": 3
  },
   {
    "title": "DO DIABETICS NEED ADDITIONAL DENTAL CARE? ",
    "text": "Every time you visit your dentist in Rockville Centre you will most likely review your health history and discuss any changes that may have happened since your last appointment. This is an important part of making sure you get the best dental care, but why? Your dentist needs to know what may be going on in other areas of your body because sometimes whole-body problems such as diabetes can increase your risk of dental problems. During this Diabetes Awareness Month, we want to share a few reasons why diabetics may need more dental care than non-diabetics. \n\nDiabetes & Gum Disease\n\nOne of the main reasons diabetics may need more dental care is because of the strong link between diabetes and gum disease. In fact, diabetics are at greater risk for gum disease than those without diabetes. Gum disease is an infection that affects the gum tissues. It’s caused by an increase in bacteria that have worked their way up under the gum line. Gum disease can put someone at risk for tooth loss and whole-body problems such as heart disease. But that’s not all. Gum disease, like any infection, can also cause blood sugar levels to increase, making diabetes more difficult to manage. ",
    "user_id": 4
  },
   {
    "title": "Caring for Your Oral Health",
    "text": "Because of the increased risk of gum disease, your dentist in Rockville Centre recommends that diabetics commit to following good oral hygiene habits. The best way to protect your teeth is to brush for two minutes every day and gently scrub your tongue to remove bacteria. Additionally, make sure you floss daily. Choose a toothpaste that contains fluoride for added defense, brush in gentle circles, and use a brush with soft bristles. This will help thoroughly clean your teeth without damaging them. And as always, make sure you also see your dentist every six months. \n\nMeasure Blood Glucose\n\nThe 30 million Americans living with diabetes know just how important it is to measure their blood sugar regularly. They also know that keeping blood glucose levels in check is crucial to protecting their health. Your dentist in Rockville Centre encourages all diabetics to measure and record their blood sugar levels daily. Your dental team may even ask for the results of some of your diabetes blood tests (the A1C or fasting blood glucose) or about your need for antibiotics before and after dental treatment for uncontrolled diabetes. ",
    "user_id": 3
  },
   {
    "title": "Eat Healthy, Stay Healthy",
    "text": "Avoiding or limiting sugary foods is an everyday part of a diabetic’s life, and it should come as no surprise that this can help protect your teeth, too. But eating healthy goes beyond restricting sugar. Diabetics can benefit from choosing fresh fruit, vegetables, whole grains, and lean meats. Of course, we always recommend working with your doctor to find a diet plan that’s right for you. \n\nThe team at our dental office in Rockville Centre believes in caring for our patients’ overall health. This means asking for health history, changes in health, and changes in medication. If you’re diabetic, sharing this information can help us better protect your oral and overall health.",
    "user_id": 4
  },
   {
    "title": "WHY IS MY SMILE SO GUMMY?",
    "text": "Our gums are an important part of our oral health. After all, they help hold our teeth in place and protect the tooth roots. But that doesn’t necessarily mean we want to see them when we smile, no matter how important they are. Nonetheless, there are some people whose gums show more prominently than others. This is known as a gummy smile. Now while there typically aren’t any problems associated with a gummy smile, they can make some feel self-conscious. When this is the case, your dentist in Rockville Centre has some options to help. \n\nCauses of a Gummy Smile\n\nBefore we dive into some of the cosmetic dentistry options that can fix a gummy smile, it’s important to know what can cause it in the first place. Some of the most common causes of a gummy smile include: \n\nAbnormal Tooth Eruption\nOne of the most common causes behind a gummy smile is the way the teeth develop and erupt. When there’s too much growth in the gum tissue it can expand up and over, essentially hiding teeth. This can create the appearance of short teeth and a gummy smile. However, oftentimes the teeth are fully developed and can be uncovered. An abundance of gum tissue can be genetic or can be a result of medication of an infection in the gums. \n\nA Bad Bite\nAt your dental appointments, your dentist in Rockville Centre will ask you to bite down and touch your top teeth to your bottom teeth in order to check your bite alignment. This can help identify several things such as a potential problem with your jaw. A bad bite may also be the reason behind a gummy smile. For example, if the upper jaw protrudes too far outward can create a gummy appearance",
    "user_id": 5
  }
]